{
  "header": [
    "I have 2+ year of professional experience working as a full time developer. Here are some details about it."
  ],
  "experience": [
    {
      "company": "SoftColon Technology Private Limited",
      "role": "Frontend Engineer",
      "duration": "Since Apr 2023",
      "description": "As a software developer, the primary role would be to design, create, and maintain software applications that meet the needs of the business or organization. This involves writing and reviewing code, testing and debugging software, and collaborating with other team members to ensure that the software meets the necessary specifications. It also involves researching new technologies and trends in the field to stay current and adapt to changing needs.",
      "techStack": "React.js, Material UI, Chakra UI, Node JS, Mongo DB",
      "url": "https://softcolon.com/"
    },
    {
      "company": "Idea to implementation infotech",
      "role": "Software Engineer",
      "duration": "Fab 2022 - Mar 2023",
      "description": "I worked on institute management application. I contributed to both the backend and frontend of the app. I implemented the integration of Google Calendar API and Razorpay Integration using SDK. Also, I developed tables using Tabler React to show students' data.",
      "techStack": "React.js, Node.js, Express.js, MongoDB",
      "url": "https://www.i2i-info.com/"
    }
  ],
  "projects": {
    "text": "Projects are a great way to apply all our learnings. Here are the ones that I have created.",
    "list": [
      {
        "name": "NutriTrack",
        "description": "This is NutriTrack your ultimate nutrition and wellness companion. Track your meals, monitor your health goals, and receive personalized nutrition plans tailored to your lifestyle. Achieve your best self with NutriTrack!",
        "techStack": "Next.js, React.js, Tailwind CSS, Framer Motion",
        "links": [
          {
            "name": "Live",
            "svg": "Eye",
            "url": "https://nutri-track-seven.vercel.app/"
          }
        ]
      },
      {
        "name": "Personal Portfolio",
        "description": "This is my portfolio, where I showcase my skills and projects built using cutting-edge technologies and innovative design.",
        "techStack": "Next.js, React.js",
        "links": [
          {
            "name": "GitHub",
            "svg": "GitHub",
            "url": "https://github.com/JayJasani/personal_portfolio"
          },
          {
            "name": "Live",
            "svg": "Eye",
            "url": "https://personal-portfolio-esya-buaskcnqk-jayjasanis-projects.vercel.app/"
          }
        ]
      },
      {
        "name": "Discord Bot",
        "description": "This is a versatile Discord bot designed to simplify server management, offering easy-to-use moderation, entertainment, and utility commands for seamless community engagement.",
        "techStack": "Node js",
        "links": [
          {
            "name": "GitHub",
            "svg": "GitHub",
            "url": "https://github.com/JayJasani/discord_bot"
          }
        ]
      }
    ]
  },
  "codingProfiles": "I like solving problems related to DSA. Here are some of my profiles."
}
